
class Texts():
    startmessage = 'Чем могу быть полезен?'
    welcomemes = 'Привет, {firstname}! Я помогу тебе рассказать всем о своем продукте)'
    comebackmes = 'Обязательно возвращайся!'
    errormes = 'Ой, что-то пошло не так. Попробуй еще раз.'
    successful_payment = "Ура! Платеж на сумму `{total_amount} {currency}` совершен успешно!" \
                         "Приятного пользования нашим сервисом!"
    sendinstuct = '📨Остаток сообщений: {mescount}\n\n💬Для создания рассылки:\n\n' \
                  '1. Пополняй баланс через ЮКасса и приобретай сообщения💳\n\n' \
                  '2. Добавляй ⚡️новую целевую аудиторию, выбирай\n' \
                  '👤существующую или используй 🔥нашу ЦА🔥 для максимального эффекта!\n\n' \
                  '3. Запускай✅'
    profiletext = 'Ваш ID: {chat_id}\nНик: {username}\nКол-во сообщений: {mescount}\n' \
                  'Рефералы: {refcount}\nСуб-рефералы: {subrefcount}\nБаланс: {balance}'
    abouttext = 'Тут что-то о нас вроде как, поэтому как бы да'
    supporttext = 'Ты можешь обратиться к нашему менеджеру напрямую'
    partertext = 'Приведено рефералов: {refcount}\nПривели твои рефералы: {subrefcount}\n' \
                 'Баланс: {balance}\nТвоя ссылка: {referal_link}\n\n' \
                 'Здесь ты можешь стать нашим партнером. Приводи знакомых - уводи врагов'
    channel_invite_af = 'Для пользования функционалом бота ты должен\n\n ❌ Подписаться на канал\n\n' \
                     '❌ Поделиться контактом\n\n' \
                        '✅ Продать свою мать'
    channel_invite_st = 'Для пользования функционалом бота ты должен\n\n ✅ Подписаться на канал\n\n' \
                                '❌ Поделиться контактом\n\n' \
                                '✅ Продать свою мать'
    channel_invite_ct = 'Для пользования функционалом бота ты должен\n\n ❌ Подписаться на канал\n\n' \
                        '✅ Поделиться контактом\n\n' \
                        '✅ Продать свою мать'
    phone_accept = 'Контакты обновлены успешно'
    sub_decline = 'Не-а, ты еще не подписался)\n\n'
    refererr = 'Ты не можешь пригласить себя сам'
    keep_money = 'Тут должно лежать положение о выводе средств'


class Links():
    feedbacklink = 'https://t.me/+5nxj8AINWBtlMTUy'
    supportlink = 'http://t.me/TeleTargetSupportRobot'
    channel_id = '@TelegProject'
    channel_url = 'https://t.me/TelegProject'